-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2020 年 7 月 16 日 15:56
-- サーバのバージョン： 10.4.11-MariaDB
-- PHP のバージョン: 7.4.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `09_36_yomodaarika`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `speech_table`
--

CREATE TABLE `speech_table` (
  `sn` bigint(20) NOT NULL,
  `user_id` varchar(50) NOT NULL,
  `speech_content` varchar(128) NOT NULL,
  `photo_fn` varchar(128) NOT NULL,
  `speech_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `speech_table`
--

INSERT INTO `speech_table` (`sn`, `user_id`, `speech_content`, `photo_fn`, `speech_at`) VALUES
(4, '101', '何か投稿１', '', '2020-07-14 23:52:12'),
(5, '101', '何か投稿２', '', '2020-07-15 00:02:28'),
(6, '103', '何か投稿3', '', '2020-07-15 00:04:30'),
(7, '101', '何か投稿4', '20200714-170842-101.jpg', '2020-07-15 00:08:42'),
(8, '101', '何か投稿5', '20200714-172256-101.jpg', '2020-07-15 00:22:56'),
(9, '101', '何か投稿6', '20200714-172309-101.jpg', '2020-07-15 00:23:09'),
(10, '103', '何か投稿7', '20200714-172635-101.jpg', '2020-07-15 00:26:35'),
(11, '101', '何か投稿8', '20200714-173355-101.jpg', '2020-07-15 00:33:55'),
(12, '101', '何か投稿9', '20200714-173436-101.jpg', '2020-07-15 00:34:36'),
(13, '101', '何か投稿10', '20200714-173649-101.jpg', '2020-07-15 00:36:50'),
(14, '103', '何か投稿11', '20200714-173901-101.jpg', '2020-07-15 00:39:01'),
(15, '101', '何か投稿12', '20200714-173936-101.jpg', '2020-07-15 00:39:36'),
(16, '101', '何か投稿13', '20200714-174503-101.jpg', '2020-07-15 00:45:04'),
(17, '102', 'ああああ15', '20200714-175359-102.jpg', '2020-07-15 00:53:59'),
(18, '101', 'aaaa', '20200714-181821-101.jpg', '2020-07-15 01:18:21'),
(19, '101', 'aaaa', '20200714-182024-101.jpg', '2020-07-15 01:20:24'),
(20, '103', '中原さんと沖さんとオールナイト', '20200714-185152-103.jpg', '2020-07-15 01:51:53'),
(21, '103', '中原さんと沖さんとオールナイト', '20200714-185257-103.jpg', '2020-07-15 01:52:58'),
(22, '333', 'アイウエオ', '20200714-185326-333.jpg', '2020-07-15 01:53:27'),
(23, '111', '出るかな', '20200714-190335-111.jpg', '2020-07-15 02:03:35'),
(24, '111', 'こんにちは', '20200715-121625-111.jpg', '2020-07-15 19:16:25'),
(25, '103', 'あああああ', '20200715-121727-103.jpg', '2020-07-15 19:17:27'),
(26, '101', 'オールナイト', '20200715-134349-101.jpg', '2020-07-15 20:43:49'),
(27, '101', '今日は1分で50個ゴミを拾った。高速ゴミ拾い！！！', '20200715-155047-101.jpg', '2020-07-15 22:50:47'),
(28, '101', '今日も頑張った。', '20200715-164432-101.jpg', '2020-07-15 23:44:32'),
(29, '101', '今日はゴミを３０個拾った！', '20200716-135702-101.jpg', '2020-07-16 20:57:03'),
(30, '103', 'ゴミ拾い', '20200716-143727-103.jpg', '2020-07-16 21:37:27'),
(31, '6jTt53ZrejV4OmkQcU4t1GpCUme2', 'ゴミ拾い', '', '2020-07-16 22:25:00'),
(32, '101', 'ゴミ拾い', '', '2020-07-16 22:25:27'),
(33, '101', 'aaaa', '20200716-152746-101.jpg', '2020-07-16 22:27:46'),
(34, '6jTt53ZrejV4OmkQcU4t1GpCUme2', 'ゴミゴミ', '', '2020-07-16 22:31:35'),
(35, '', 'なんで', '20200716-153200-.jpg', '2020-07-16 22:32:00'),
(36, '', 'ゴミ拾い', '20200716-153614-.jpg', '2020-07-16 22:36:14'),
(37, '', '完成か', '20200716-154135-.jpg', '2020-07-16 22:41:35');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `speech_table`
--
ALTER TABLE `speech_table`
  ADD PRIMARY KEY (`sn`),
  ADD KEY `user_id` (`user_id`),
  ADD KEY `speech_at` (`speech_at`);

--
-- ダンプしたテーブルのAUTO_INCREMENT
--

--
-- テーブルのAUTO_INCREMENT `speech_table`
--
ALTER TABLE `speech_table`
  MODIFY `sn` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
